# Brewfile for Alderaan
# Homebrew Taps
tap 'caskroom/cask'
tap 'd12frosted/emacs-plus'
tap 'homebrew/binary'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'
tap 'thoughtbot/formulae'

# Homebrew packages
brew 'libyaml'
brew 'openssl'
brew 'pkg-config'
brew 'ansible'
brew 'arm'
brew 'asciinema'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash-git-prompt'
brew 'bfg'
brew 'icu4c'
brew 'boost'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'cloc'
brew 'gdbm'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'net-snmp'
brew 'collectd'
brew 'cscope'
brew 'csshx'
brew 'libidn'
brew 'curl'
brew 'devtodo'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'gnu-tar'
brew 'xz'
brew 'dpkg'
brew 'libtool'
brew 'jpeg'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'git'
brew 'go'
brew 'exercism'
brew 'faac'
brew 'lame'
brew 'libssh'
brew 'x264'
brew 'xvid'
brew 'zeromq'
brew 'ffmpeg'
brew 'freeimage'
brew 'gobject-introspection'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'geoip'
brew 'gh'
brew 'gibo'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'gmp'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'gnupg2'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'godep'
brew 'harfbuzz'
brew 'htop-osx'
brew 'hub'
brew 'libcroco'
brew 'pango'
brew 'librsvg'
brew 'imagemagick'
brew 'iproute2mac'
brew 'json-c'
brew 'json-glib'
brew 'jsoncpp'
brew 'keybase'
brew 'kubernetes-cli'
brew 'libvo-aacenc'
brew 'libav'
brew 'libevent'
brew 'popt'
brew 'librsync'
brew 'luajit'
brew 'lynx'
brew 'macvim'
brew 'mas'
brew 'msgpack'
brew 'mysql'
brew 'nmap'
brew 'node', args: ['with-full-icu']
brew 'redis'
brew 'rrdtool'
brew 'wget'
brew 'ntopng'
brew 'openssl@1.1'
brew 'p7zip'
brew 'packer'
brew 'passenger'
brew 'prometheus'
brew 'pwgen'
brew 'qt'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rdiff-backup'
brew 'reaver'
brew 'riemann'
brew 'sbt'
brew 'skipfish'
brew 'surfraw'
brew 'sysdig'
brew 'tcpflow'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmate'
brew 'todo-txt'
brew 'tree'
brew 'unixodbc'
brew 'unrar'
brew 'youtube-dl'
brew 'd12frosted/emacs-plus/emacs-plus'
brew 'homebrew/dupes/libiconv'
brew 'homebrew/x11/rxvt-unicode'
brew 'thoughtbot/formulae/gitsh'

# Homebrew "Cask" packages
cask 'adobe-reader'
cask 'atom'
cask 'audio-hijack-pro'
cask 'clamxav'
cask 'comicbooklover'
cask 'consul'
cask 'crashplan'
cask 'cyberduck'
cask 'dash'
cask 'devonthink-pro'
cask 'disk-inventory-x'
cask 'evernote'
cask 'firefox'
cask 'fluid'
cask 'gimp'
cask 'github'
cask 'github-desktop'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-refine'
cask 'gulp'
cask 'harvest'
cask 'heroku-toolbelt'
cask 'hipchat'
cask 'jd-gui'
cask 'keepassx'
cask 'kitematic'
cask 'lighttable'
cask 'limechat'
cask 'marsedit'
cask 'mou'
cask 'ngrok'
cask 'notational-velocity'
cask 'omnigraffle'
cask 'pgadmin3'
cask 'postgres'
cask 'racket'
cask 'razorsql'
cask 'skype'
cask 'soundcloud-downloader'
cask 'sourcetree'
cask 'sublime-text'
cask 'torbrowser'
cask 'transmission'
cask 'truecrypt'
cask 'wireshark'

# Mac App Store packages
mas 'InfoSlips Viewer (1.6.1)', id: 932753873
mas 'Markoff (1.0.1)', id: 1084713122
mas 'Keynote (6.6.2)', id: 409183694
mas 'Kiwi for Gmail (1.10.1)', id: 986304488
mas 'Course For Final Cut Pro X 101 - Overview and Quick Start Guide (2.0.2)', id: 446934377
mas 'pwSafe (4.9)', id: 520993579
mas 'Install macOS Sierra (12.0.49)', id: 1127487414
mas 'Twitter (4.2.4)', id: 409789998
mas 'iPhoto (9.6.1)', id: 408981381
mas 'GarageBand (10.1.3)', id: 682658836
mas 'Be Focused Pro (1.3)', id: 961632517
mas '1Password (6.3.5)', id: 443987910
mas 'Inbox Classic (1.6.1)', id: 528008223
mas 'Numbers (3.6.2)', id: 409203825
mas 'Xcode (8.0)', id: 497799835
mas "Baldur's Gate - Enhanced Edition (1.3.2053)", id: 568196938
mas 'Pages (5.6.2)', id: 409201541
mas 'iMovie (10.1.3)', id: 408981434
mas 'Microsoft Remote Desktop (8.0.27221)', id: 715768417
mas 'Logic Pro X (10.2.4)', id: 634148309
